InformationRegisters/БухучетРезервовПоОплатеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>БухучетРезервовПоОплатеТруда</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияРезервовПоОплатеТрудаВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяФинансированияРезервовПоОплатеТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансированияЗарплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРезервовПоОплатеТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияРасчетовРезервовПоОплатеТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БухучетРезервовПоОплатеТруда/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Организация", "РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

Функция ПараметрыВычисленияВеса() Экспорт
	
	ПараметрыВычисленияВеса = Новый Структура;
	ПараметрыВычисленияВеса.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыВычисленияВеса.Вставить("Резерв", Справочники.Резервы.ПустаяСсылка());
	ПараметрыВычисленияВеса.Вставить("Подразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ПараметрыВычисленияВеса.Вставить("СпособОтраженияЗарплатыВБухучете", Справочники.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка());
	ПараметрыВычисленияВеса.Вставить("СтатьяФинансированияЗарплаты", Справочники.СтатьиФинансированияЗарплата.ПустаяСсылка());
	
	Возврат ПараметрыВычисленияВеса;
	
КонецФункции

Функция ВесВсехПоказателей(ПараметрыВычисленияВеса) Экспорт
	
	ВесПоказателей = 
	?(ЗначениеЗаполнено(ПараметрыВычисленияВеса.Организация), ВесПоляОрганизация(), 0)
	+ ?(ЗначениеЗаполнено(ПараметрыВычисленияВеса.Резерв), ВесПоляРезерв(), 0)
	+ ?(ЗначениеЗаполнено(ПараметрыВычисленияВеса.Подразделение), ВесПоляПодразделение(), 0)
	+ ?(ЗначениеЗаполнено(ПараметрыВычисленияВеса.СпособОтраженияЗарплатыВБухучете), ВесПоляСпособОтражения(), 0)
	+ ?(ЗначениеЗаполнено(ПараметрыВычисленияВеса.СтатьяФинансированияЗарплаты), ВесПоляСтатьяФинансирования(), 0);
	
	Возврат ВесПоказателей;
	
КонецФункции

Функция ВесПоляОрганизация() Экспорт
	Возврат 5;
КонецФункции

Функция ВесПоляРезерв() Экспорт
	Возврат 7;
КонецФункции

Функция ВесПоляПодразделение() Экспорт
	Возврат 11;
КонецФункции

Функция ВесПоляСтатьяФинансирования() Экспорт
	Возврат 19;
КонецФункции

Функция ВесПоляСпособОтражения() Экспорт
	Возврат 27;
КонецФункции

Функция Приоритет(Вес) Экспорт
	
	ТаблицаКомбинаций = ТаблицаКомбинацийВесаПриоритетаПолейОтбора();
	СтрокаТаблицы = ТаблицаКомбинаций.Найти(Вес, "Вес");
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат 100;
	Иначе
		Возврат СтрокаТаблицы.Приоритет;
	КонецЕсли;
	
КонецФункции

Функция ТаблицаКомбинацийВесаПриоритетаПолейОтбора() Экспорт
	
	// Вес складывается исходя из принципа:
	//  - заполнена организация = 5
	//  - заполнен резерв = 7
	//  - заполнено подразделение = 11
	//  - заполнена статья финансирования = 19
	//  - заполнен способ отражения = 27
	// Все значения суммируются. Сумма значений уникальна и задает комбинацию заполненных полей.
	// Все поля заполнены = 69 (max), все пустые = 0 (min)
	// В подсистеме обычно организация и резервы в ТЧ опускаются, поэтому в полях отбора также опускаем.
	
	
	ТаблицаКомбинаций = Новый ТаблицаЗначений;
	ТаблицаКомбинаций.Колонки.Добавить("ПоляОтбора", Новый ОписаниеТипов("Строка"));
	ТаблицаКомбинаций.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число"));
	ТаблицаКомбинаций.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	
	// "Организация, Резерв, Подразделение, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 1;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляРезерв() + ВесПоляПодразделение() + ВесПоляСтатьяФинансирования() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "Подразделение, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете";
	
	// "Организация, Резерв, Подразделение, СтатьяФинансирования"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 2;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляРезерв() + ВесПоляПодразделение() + ВесПоляСтатьяФинансирования();
	НоваяСтрока.ПоляОтбора = "Подразделение, СтатьяФинансирования";
	
	// "Организация, Резерв, Подразделение, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 3;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляРезерв() + ВесПоляПодразделение() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "Подразделение, СпособОтраженияЗарплатыВБухучете";
	
	// "Организация, Резерв, Подразделение"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 4;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляРезерв() + ВесПоляПодразделение();
	НоваяСтрока.ПоляОтбора = "Подразделение";
	
	// "Организация, Резерв, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 5;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляРезерв() + ВесПоляСтатьяФинансирования() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете";
	
	// "Организация, Резерв, СтатьяФинансирования"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 6;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляРезерв() + ВесПоляСтатьяФинансирования();
	НоваяСтрока.ПоляОтбора = "СтатьяФинансирования";
	
	// "Организация, Резерв, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 7;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляРезерв() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "СпособОтраженияЗарплатыВБухучете";
	
	// "Организация, Резерв"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 8;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляРезерв();
	НоваяСтрока.ПоляОтбора = "";
	
	// "Организация, Подразделение, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 9;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляПодразделение() + ВесПоляСтатьяФинансирования() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "Подразделение, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете";
	
	// "Организация, Подразделение, СтатьяФинансирования"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 10;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляПодразделение() + ВесПоляСтатьяФинансирования();
	НоваяСтрока.ПоляОтбора = "Подразделение, СтатьяФинансирования";
	
	// "Организация, Подразделение, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 11;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляПодразделение() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "Подразделение, СпособОтраженияЗарплатыВБухучете";
	
	// "Организация, Подразделение"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 12;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляПодразделение();
	НоваяСтрока.ПоляОтбора = "Подразделение";
	
	// "Организация, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 13;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляСтатьяФинансирования() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете";
	
	// "Организация, СтатьяФинансирования"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 14;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляСтатьяФинансирования();
	НоваяСтрока.ПоляОтбора = "СтатьяФинансирования";
	
	// "Организация, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 15;
	НоваяСтрока.Вес = ВесПоляОрганизация() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "СпособОтраженияЗарплатыВБухучете";
	
	// "Организация"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 16;
	НоваяСтрока.Вес = ВесПоляОрганизация();
	НоваяСтрока.ПоляОтбора = "";
	
	// "Резерв, Подразделение, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 17;
	НоваяСтрока.Вес = ВесПоляРезерв() + ВесПоляПодразделение() + ВесПоляСтатьяФинансирования() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "Подразделение, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете";
	
	// "Резерв, Подразделение, СтатьяФинансирования"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 18;
	НоваяСтрока.Вес = ВесПоляРезерв() + ВесПоляПодразделение() + ВесПоляСтатьяФинансирования();
	НоваяСтрока.ПоляОтбора = "Подразделение, СтатьяФинансирования";
	
	// "Резерв, Подразделение, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 19;
	НоваяСтрока.Вес = ВесПоляРезерв() + ВесПоляПодразделение() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "Подразделение, СпособОтраженияЗарплатыВБухучете";
	
	// "Резерв, Подразделение"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 20;
	НоваяСтрока.Вес = ВесПоляРезерв() + ВесПоляПодразделение();
	НоваяСтрока.ПоляОтбора = "Подразделение";
	
	// "Резерв, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 21;
	НоваяСтрока.Вес = ВесПоляРезерв() + ВесПоляСтатьяФинансирования() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете";
	
	// "Резерв, СтатьяФинансирования"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 22;
	НоваяСтрока.Вес = ВесПоляРезерв() + ВесПоляСтатьяФинансирования();
	НоваяСтрока.ПоляОтбора = "СтатьяФинансирования";
	
	// "Резерв, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 23;
	НоваяСтрока.Вес = ВесПоляРезерв() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "СпособОтраженияЗарплатыВБухучете";
	
	// "Резерв"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 24;
	НоваяСтрока.Вес = ВесПоляРезерв();
	НоваяСтрока.ПоляОтбора = "";
	
	// "Подразделение, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 25;
	НоваяСтрока.Вес = ВесПоляПодразделение() + ВесПоляСтатьяФинансирования() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "Подразделение, СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете";
	
	// "Подразделение, СтатьяФинансирования"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 26;
	НоваяСтрока.Вес = ВесПоляПодразделение() + ВесПоляСтатьяФинансирования();
	НоваяСтрока.ПоляОтбора = "Подразделение, СтатьяФинансирования";
	
	// "Подразделение, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 27;
	НоваяСтрока.Вес = ВесПоляПодразделение() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "Подразделение, СпособОтраженияЗарплатыВБухучете";
	
	// "Подразделение"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 28;
	НоваяСтрока.Вес = ВесПоляПодразделение();
	НоваяСтрока.ПоляОтбора = "Подразделение";
	
	// "СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 29;
	НоваяСтрока.Вес = ВесПоляСтатьяФинансирования() + ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "СтатьяФинансирования, СпособОтраженияЗарплатыВБухучете";
	
	// "СтатьяФинансирования"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 30;
	НоваяСтрока.Вес = ВесПоляСтатьяФинансирования();
	НоваяСтрока.ПоляОтбора = "СтатьяФинансирования";
	
	// "СпособОтраженияЗарплатыВБухучете"
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 31;
	НоваяСтрока.Вес = ВесПоляСпособОтражения();
	НоваяСтрока.ПоляОтбора = "СпособОтраженияЗарплатыВБухучете";
	
	// ""
	НоваяСтрока = ТаблицаКомбинаций.Добавить();
	НоваяСтрока.Приоритет = 32;
	НоваяСтрока.Вес = 0;
	НоваяСтрока.ПоляОтбора = "";
	
	Возврат ТаблицаКомбинаций;
	
КонецФункции

Функция НайденЗапретИзмененияДанных(ДатаПроверки) Экспорт
	
	НайденЗапретИзмененияДанных = Ложь;
	
	ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	НоваяСтрока = ДанныеДляПроверки.Добавить();
	НоваяСтрока.Дата = ДатаПроверки;
	НоваяСтрока.Раздел = "БухгалтерскийУчетЗарплаты";
	Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки) Тогда
		НайденЗапретИзмененияДанных = Истина;
	КонецЕсли;
	
	Возврат НайденЗапретИзмененияДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
